# encoding: utf-8
class ArTTY::Art::PkmnEmeraldI128TaurosShiny < ArTTY::Art
    def color_map
        return [
            "               2ccc                           2 c     λ",
            "              c110000c        c00002ccc       210c0 ",
            "             c0011100c       c01000b222cb    211110c",
            "            ccc00101022      c11010b    2b  cc10100c",
            "              cc00100cc2     c1110b      2b  c11010b",
            "                c000c  cc222cc1100b      2b  c11000b",
            "                 ccc     cbbbc1c0cb       2b c00000b",
            "                             c1cc b       2b  2cc0b ",
            "                    5522225   c2cb        2b    0b  ",
            "                  259999999522  2b      21112   2b  ",
            "                 599999999998952 2b   22cbbbc220b   ",
            "                599999999998988822b  2c   2c bbc    ",
            "               29999999999898988552 2c   0b         ",
            "             cc88cc888c8889898888552c2222b          ",
            "            c10cc1cccc1cc88888888852cbbbb           ",
            "     4     cc111111111100cc88888885522              ",
            "    47d  ccc111131111100000c888888852522            ",
            "   d7d   c113313311010100000cc8888882555b           ",
            "   47d  c1133133111101000000c7c8888885555b          ",
            "  4677d c1131111111010000000c6c88888855555b         ",
            "  d6677d111111ccc10101000000c64c88888855552         ",
            "  d46677d0110cd7dccc0000000c764c88888885555b        ",
            "   d46677d0cc84dd555ccc00cc7644cc88888888552        ",
            "   d4466d728888888555d7cc77664c0c88888888855b       ",
            "    c44d728884d588855d7d776644b0c888588888852       ",
            "    cc4d628547d588855d6d66644b00cc88528888852       ",
            "    c1c428584d58888855d6d444b000c0c8528888885b      ",
            "   c311c55999988888855d4d4bb000000b8528888885b      ",
            "   c3111c89449888888555d4c0000000b88558888885b      ",
            "   c1011c9474d58888c255d4c00000000b8552888885b      ",
            "  031011c9d4dd5889c62555c0000101000b552888885b      ",
            "  ccc011c99dd5889cba255c0000011110c5552888885b      ",
            "    c111229998889262555c0000001010b5552888885b      ",
            "   c11311c9999888225555c0010000000b5552888882       ",
            "   c13311c999988888555b0001000000b55552588882       ",
            "  0103311c8999888855bb00001100000b5552558888b       ",
            "  ccc33311292228885b000010110c00c5555b558888b       ",
            "   0b13331c2331c855b000011000c00b5555b558888b       ",
            "    b13131c33000c5b0000011000bc0b5555b5558882       ",
            "    b1113112ccccc5b000010100b5c0b555b555558882      ",
            "     ccc331255555b000111000b555b5555bb5555888b      ",
            "     25c1311cbbbc1001101000b555c5555b bb55888b      ",
            "     285c1111111110000000cb55552555b    b5588b      ",
            "     285c111131111000000cb555555b5b      b5888b     ",
            "     2855c10131111000010b5558855bb        b5882     ",
            "    22885c1b133101000110b5588885b         b5888b    ",
            "    528855cb01310000011b558888852          b8882    ",
            "   58588555bc011000c011bbb88888552         25885b   ",
            "   2888555b  cc100bcc1c5b 2888855b        b555552   ",
            "   b88855b     c0b bcc52b  288855b        b55555bb  ",
            "   b8855b       b  b4dbbb  b88855b        2b555bbb  ",
            "   b8852           b4dbbb  b88855b         bbd4dbb  ",
            "  22855b            bbbb    b88852         bbd4dbb  ",
            "  28855b                     b8855b          bbbb   ",
            " 288852                      b8885b                 ",
            " 28855b                       b8855b                ",
            " bd555b                       b88852                ",
            "b44dbb                        2888552               ",
            "bddbbb                        b8885bb               ",
            "bbbbbb                        bbd4dbbb              ",
            " bbb                           bb44dbb              ",
            "                               bbd4dbb              ",
            "                                bbbbb               ",
        ]
    end

    def initialize
        super
        @name = "pkmn-emerald-I-128-tauros-shiny"
        map_color("0", "color_028")
        map_color("1", "color_070")
        map_color("2", "color_095")
        map_color("3", "color_113")
        map_color("4", "color_140")
        map_color("5", "color_179")
        map_color("6", "color_183")
        map_color("7", "color_189")
        map_color("8", "color_221")
        map_color("9", "color_227")
        map_color("a", "color_231")
        map_color("b", "color_233")
        map_color("c", "color_236")
        map_color("d", "color_240")
    end
end
