# encoding: utf-8
class ArTTY::Art::PkmnEmeraldII201UnownR < ArTTY::Art
    def color_map
        return [
            "     333322      λ",
            "  344055444432   ",
            " 34005444444432  ",
            " 400543322444432 ",
            " 405430110234442 ",
            "30543111111244432",
            "30430113251024432",
            "35431131221124432",
            "24421122421124432",
            "24420152251025432",
            " 444211111124542 ",
            " 344320110235432 ",
            " 34444222245442  ",
            " 234444455544332 ",
            " 4233444444333432",
            " 4322233332234442",
            " 532  3223  23432",
            " 032         222 ",
            " 032             ",
            " 532             ",
            " 532             ",
            " 432             ",
            " 432             ",
            " 332             ",
            " 22              ",
        ]
    end

    def initialize
        super
        @name = "pkmn-emerald-II-201-unown-R"
        map_color("0", "color_188")
        map_color("1", "color_231")
        map_color("2", "color_233")
        map_color("3", "color_239")
        map_color("4", "color_242")
        map_color("5", "color_247")
    end
end
