# encoding: utf-8
class ArTTY::Art::PkmnEmeraldII201UnownP < ArTTY::Art
    def color_map
        return [
            " 22              λ",
            "3543224444422    ",
            "34324555444432   ",
            " 32405444444432  ",
            " 240543322444432 ",
            " 405430110234442 ",
            " 0543111111244432",
            "35430113251024432",
            "35431131221124432",
            "34421122421124432",
            "24420152251024432",
            "24442111111245432",
            "2444320110235442 ",
            "2344442222454432 ",
            "223444445554432  ",
            "23223444444432   ",
            "332 223333322    ",
            "332   22222      ",
            "332              ",
            "332              ",
            "232              ",
            "232              ",
            "232              ",
            "232              ",
            " 2               ",
        ]
    end

    def initialize
        super
        @name = "pkmn-emerald-II-201-unown-P"
        map_color("0", "color_188")
        map_color("1", "color_231")
        map_color("2", "color_233")
        map_color("3", "color_239")
        map_color("4", "color_242")
        map_color("5", "color_247")
    end
end
